Закупки/src/Documents/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказы</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияТоваров</name>
    <type>
      <types>CatalogRef.КатегорииТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Закупки/src/Documents/Заказы/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Стр = Элементы.Товары.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Стр = Элементы.Товары.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество;
КонецПроцедуры



&НаКлиенте
Процедура ЗаполнитьТЧПоЗаявкам(Команда)
	ЗаполнитьТЧПоЗаявкамНаСервере();
КонецПроцедуры

Процедура ЗаполнитьТЧПоЗаявкамНаСервере()
	Объект.Товары.Очистить();
	тз = Новый ТаблицаЗначений;
    тз.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ВнутренниеЗаявки"));
    
    Для Каждого Заявка из Заявки Цикл
        ЗаполнитьЗначенияСвойств(тз.Добавить(), Заявка.Значение)
    КонецЦикла;
	
	Выборка = Справочники.Номенклатура.ВыбратьИерархически();
	СписокРодители = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		Если Выборка.УровеньВВыборке() = 0 Тогда
			СписокРодители.Добавить(Выборка.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Родитель из СписокРодители Цикл
		Сообщить(Родитель.Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос;
//	Запрос.Текст = 
	
//		"ВЫБРАТЬ
//		|	ВнутренниеЗаявкиТовары.Номенклатура КАК Номенклатура,
//		|	СУММА(ВнутренниеЗаявкиТовары.Количество) КАК Количество
//		|ИЗ
//		|	Документ.ВнутренниеЗаявки.Товары КАК ВнутренниеЗаявкиТовары,
//		|ГДЕ
//		|	ВнутренниеЗаявкиТовары.Номенклатура.Родитель = &Родитель
//		|СГРУППИРОВАТЬ ПО
//		|	ВнутренниеЗаявкиТовары.Номенклатура";
//	
	
//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	ТЗ.Ссылка КАК Ссылка
//		|ПОМЕСТИТЬ ТЗ
//		|ИЗ
//		|	&ТЗ КАК ТЗ
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВнутренниеЗаявкиТовары.Номенклатура КАК Номенклатура,
//		|	СУММА(ВнутренниеЗаявкиТовары.Количество) КАК Количество
//		|ИЗ
//		|	Документ.ВнутренниеЗаявки.Товары КАК ВнутренниеЗаявкиТовары
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ
//		|		ПО ВнутренниеЗаявкиТовары.Ссылка = ТЗ.Ссылка
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ВнутренниеЗаявкиТовары.Номенклатура";
//	
//	
//	Запрос.УстановитьПараметр("ТЗ", ТЗ);

//	Запрос.УстановитьПараметр("Родитель", Родитель);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Строка = Объект.Товары.Добавить();
//		Строка.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
//		Строка.Количество = ВыборкаДетальныеЗаписи.Количество;
//	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//	Элементы.КатегорияТоваров;
КонецПроцедуры
